tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "linode/cli"
tap "puma/puma"
tap "raggi/ale"
tap "sass/sass"
brew "age"
brew "brotli"
brew "giflib"
brew "xz"
brew "little-cms2"
brew "jpeg-xl"
brew "aom"
brew "apr"
brew "ca-certificates"
brew "openssl@3"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "assimp"
brew "atomicparsley"
brew "m4"
brew "autoconf-archive"
brew "automake"
brew "mpdecimal"
brew "awscli"
brew "bdw-gc"
brew "berkeley-db", link: true
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "lzo"
brew "pixman"
brew "cairo"
brew "graphite2"
brew "harfbuzz"
brew "openjdk"
brew "bfg"
brew "boost"
brew "sbcl"
brew "buildapp"
brew "c-ares"
brew "cabextract"
brew "cfitsio"
brew "chezmoi"
brew "cjson"
brew "cloc"
brew "rlwrap"
brew "clojure"
brew "gmp"
brew "cloog"
brew "cmake"
brew "libidn2"
brew "libssh2"
brew "openldap"
brew "rtmpdump"
brew "curl"
brew "libtool"
brew "freetds"
brew "libpq"
brew "libsodium"
brew "libzip"
brew "oniguruma"
brew "tidy-html5"
brew "php"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "dbus"
brew "deno"
brew "dnsmasq"
brew "docbook"
brew "docbook-xsl"
brew "doctl"
brew "double-conversion"
brew "libuv"
brew "node"
brew "eslint"
brew "exa"
brew "exiftool"
brew "faac"
brew "faad2"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "mpfr"
brew "gcc"
brew "libevent"
brew "libtasn1"
brew "hwloc"
brew "lame"
brew "openjpeg"
brew "leptonica"
brew "libb2"
brew "libass"
brew "libbluray"
brew "libsamplerate"
brew "mpg123"
brew "opus"
brew "libsoxr"
brew "libvpx"
brew "opencore-amr"
brew "pugixml"
brew "snappy"
brew "pango"
brew "rubberband"
brew "sdl2"
brew "speex"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "open-mpi"
brew "fftw"
brew "fmt"
brew "fonttools"
brew "fsevent_watch"
brew "fswatch"
brew "fzf"
brew "gdbm"
brew "gdk-pixbuf"
brew "gh"
brew "jbig2dec"
brew "ghostscript"
brew "git"
brew "git-flow"
brew "libassuan"
brew "libgcrypt"
brew "libusb"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-getopt"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "gpac"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "mecab"
brew "mecab-ipadic"
brew "msgpack"
brew "groonga"
brew "hdf5"
brew "helm"
brew "htop"
brew "httpd"
brew "ilmbase"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp", link: true
brew "imagemagick"
brew "imagemagick@6"
brew "imapsync"
brew "ipv6calc"
brew "isync"
brew "jansson"
brew "jemalloc"
brew "jq"
brew "json-c"
brew "json-glib"
brew "kubernetes-cli"
brew "leiningen"
brew "libao"
brew "libcroco"
brew "libebml"
brew "libev"
brew "libexif"
brew "libgccjit"
brew "libiconv"
brew "libimagequant"
brew "libmagic"
brew "libmatio"
brew "libmatroska"
brew "libmetalink"
brew "libproxy"
brew "libressl"
brew "libspng"
brew "libusb-compat"
brew "libvo-aacenc"
brew "libyaml"
brew "little-cms"
brew "lua"
brew "mad"
brew "makedepend"
brew "memcached"
brew "mercurial"
brew "meson"
brew "mozjpeg"
brew "mtr"
brew "xapian"
brew "mu"
brew "mutt"
brew "mysql", restart_service: true
brew "nasm"
brew "neon"
brew "net-snmp"
brew "nmap"
brew "python@3.10"
brew "node@14"
brew "nspr"
brew "nss"
brew "openslide"
brew "orc"
brew "ossp-uuid"
brew "p7zip"
brew "tree"
brew "pass"
brew "perl"
brew "pgloader"
brew "pidof"
brew "pinentry-mac"
brew "pngquant"
brew "poppler"
brew "popt"
brew "postgresql@15", restart_service: true, link: true
brew "protobuf"
brew "pth"
brew "pv"
brew "py3cairo"
brew "pygobject3"
brew "python@3.9"
brew "qt"
brew "rclone"
brew "redis", restart_service: true
brew "ren"
brew "rename"
brew "ripgrep"
brew "xxhash"
brew "rsync"
brew "ruby-build"
brew "rust"
brew "s3cmd"
brew "sane-backends"
brew "sbt"
brew "scons"
brew "scrypt"
brew "sdl12-compat"
brew "sha2"
brew "siege"
brew "sloccount"
brew "smartmontools"
brew "sox"
brew "streamlink"
brew "svgo"
brew "swig"
brew "taglib"
brew "tarsnap"
brew "telnet"
brew "terminal-notifier"
brew "texi2html"
brew "the_silver_searcher"
brew "tig"
brew "timedog"
brew "utf8proc"
brew "tmux"
brew "tnef"
brew "tree-sitter"
brew "unzip"
brew "vim"
brew "vips"
brew "wget"
brew "winetricks"
brew "woff2"
brew "wrk"
brew "yamllint"
brew "yarn"
brew "yasm"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp"]
brew "heroku/brew/heroku-node"
brew "puma/puma/puma-dev"
brew "raggi/ale/openssl-osx-ca"
brew "sass/sass/sass"
cask "1password-cli"
cask "adoptopenjdk8"
cask "audacity"
cask "chromedriver"
cask "docker"
cask "font-fira-code"
cask "lens"
cask "mysql-shell"
cask "vagrant"
cask "xquartz"
