
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'aribb24'
brew 'aspell'
brew 'assimp'
brew 'atomicparsley'
brew 'atuin'
brew 'autoconf'
brew 'autoconf-archive'
brew 'automake'
brew 'awk'
brew 'awscli'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'berkeley-db@5'
brew 'boost'
brew 'brotli'
brew 'buf'
brew 'buildapp'
brew 'c-ares'
brew 'ca-certificates'
brew 'cabextract'
brew 'cairo'
brew 'certifi'
brew 'cffi'
brew 'cfitsio'
brew 'cgif'
brew 'chezmoi'
brew 'cjson'
brew 'cloc'
brew 'clojure'
brew 'cloog'
brew 'cmake'
brew 'coreutils'
brew 'cowsay'
brew 'cryptography'
brew 'cscope'
brew 'ctags'
brew 'curl'
brew 'dav1d'
brew 'dbus'
brew 'deno'
brew 'dnsmasq'
brew 'docbook'
brew 'docbook-xsl'
brew 'doctl'
brew 'double-conversion'
brew 'duktape'
brew 'eslint'
brew 'exiftool'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fftw'
brew 'flac'
brew 'fmt'
brew 'fontconfig'
brew 'fonttools'
brew 'freetds'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fsevent_watch'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'git-flow'
brew 'glib'
brew 'gmime'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gpac'
brew 'gpgme'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'hdf5'
brew 'helm'
brew 'highway'
brew 'htop'
brew 'httpd'
brew 'hwloc'
brew 'icu4c@75'
brew 'icu4c@76'
brew 'imagemagick'
brew 'imagemagick@6'
brew 'imapsync'
brew 'imath'
brew 'ipv6calc'
brew 'isl'
brew 'isync'
brew 'jansson'
brew 'jasper'
brew 'jbig2dec'
brew 'jemalloc'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'json-c'
brew 'json-glib'
brew 'krb5'
brew 'kubernetes-cli'
brew 'lame'
brew 'leiningen'
brew 'leptonica'
brew 'libaec'
brew 'libao'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libassuan@2'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libde265'
brew 'libdeflate'
brew 'libdicom'
brew 'libebml'
brew 'libev'
brew 'libevent'
brew 'libexif'
brew 'libgccjit'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libheif'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libimagequant'
brew 'libksba'
brew 'liblinear'
brew 'liblqr'
brew 'libmagic'
brew 'libmatio'
brew 'libmatroska'
brew 'libmetalink'
brew 'libmicrohttpd'
brew 'libmpc'
brew 'libnghttp2'
brew 'libogg'
brew 'libomp'
brew 'libpng'
brew 'libpq'
brew 'libproxy'
brew 'libraw'
brew 'libressl'
brew 'librist'
brew 'librsvg'
brew 'libsamplerate'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libspng'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libusb-compat'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvo-aacenc'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxml2'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'llvm'
brew 'lua'
brew 'luajit-openresty'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mad'
brew 'make'
brew 'makedepend'
brew 'mbedtls'
brew 'mecab'
brew 'mecab-ipadic'
brew 'memcached'
brew 'mercurial'
brew 'meson'
brew 'mozjpeg'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'msgpack'
brew 'mtr'
brew 'mu'
brew 'mysql'
brew 'nasm'
brew 'ncurses'
brew 'neon'
brew 'net-snmp'
brew 'netpbm'
brew 'nettle'
brew 'ninja'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'oniguruma'
brew 'open-mpi'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjpeg'
brew 'openldap'
brew 'openslide'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'opus'
brew 'opusfile'
brew 'orc'
brew 'ossp-uuid'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pass'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pgloader'
brew 'pidof'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pixman'
brew 'pkgconf'
brew 'pmix'
brew 'pngquant'
brew 'pnpm'
brew 'poppler'
brew 'popt'
brew 'postgresql@15'
brew 'protobuf'
brew 'pth'
brew 'pugixml'
brew 'pv'
brew 'py3cairo'
brew 'pycparser'
brew 'pygobject3'
brew 'python-packaging'
brew 'python@3.10'
brew 'python@3.12'
brew 'python@3.13'
brew 'python@3.9'
brew 'pyyaml'
brew 'qrencode'
brew 'rav1e'
brew 'rclone'
brew 'readline'
brew 'redis'
brew 'ren'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'rsync'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'ruby-build'
brew 'rust'
brew 's3cmd'
brew 'sane-backends'
brew 'sbcl'
brew 'scons'
brew 'scrypt'
brew 'sdl12-compat'
brew 'sdl2'
brew 'sevenzip'
brew 'sha2'
brew 'shared-mime-info'
brew 'siege'
brew 'sloccount'
brew 'smartmontools'
brew 'snappy'
brew 'sox'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'streamlink'
brew 'svgo'
brew 'svt-av1'
brew 'swig'
brew 'taglib'
brew 'tarsnap'
brew 'telnet'
brew 'terminal-notifier'
brew 'tesseract'
brew 'texi2html'
brew 'texinfo'
brew 'theora'
brew 'tig'
brew 'timedog'
brew 'tmux'
brew 'tnef'
brew 'tree'
brew 'tree-sitter'
brew 'unbound'
brew 'unixodbc'
brew 'unzip'
brew 'utf8proc'
brew 'uthash'
brew 'util-macros'
brew 'vim'
brew 'vips'
brew 'webp'
brew 'wget'
brew 'winetricks'
brew 'woff2'
brew 'wrk'
brew 'x264'
brew 'x265'
brew 'xapian'
brew 'xorgproto'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'yamllint'
brew 'yasm'
brew 'yazi'
brew 'z3'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zoxide'
brew 'zsh'
brew 'zstd'

tap 'homebrew/cask'
cask '1password-cli'
cask 'audacity'
cask 'chromedriver'
cask 'docker'
cask 'font-fira-code'
cask 'font-symbols-only-nerd-font'
cask 'ghostty'
cask 'lens'
cask 'mysql-shell'
cask 'vagrant'
cask 'xquartz'

tap 'homebrew/services'

tap 'd12frosted/emacs-plus'
brew 'emacs-plus@30'

tap 'dart-lang/dart'
brew 'dart'

tap 'github/gh'

tap 'heroku/brew'
brew 'heroku-node'

tap 'puma/puma'
brew 'puma-dev'

tap 'raggi/ale'
brew 'openssl-osx-ca'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'sass/sass'
brew 'sass'

# Other Homebrew packages
brew 'python-pathspec'

# App Store applications
mas '1Blocker (4.6.2)', id: 1365531024
mas '1Password for Safari (8.10.56)', id: 1569813296
mas 'Apple Configurator (2.17)', id: 1037126344
mas 'Blackmagic Disk Speed Test (3.4.2)', id: 425264550
mas 'Color Picker (2.0.3)', id: 1545870783
mas 'FitFileExplorer (3.5)', id: 1244431640
mas 'Flow (3.3.1)', id: 1423210932
mas 'GarageBand (10.4.11)', id: 682658836
mas 'iMovie (10.4.3)', id: 408981434
mas 'JSONPeep (1.3.2)', id: 1458969831
mas 'Keynote (14.3)', id: 409183694
mas 'Lungo (2.6.0)', id: 1263070803
mas 'Messenger (226.0)', id: 1480068668
mas 'Microsoft Outlook (16.92)', id: 985367838
mas 'Monosnap (6.1.0)', id: 540348655
mas 'Numbers (14.3)', id: 409203825
mas 'Omnivore (1.38.0)', id: 1564031042
mas 'Pages (14.3)', id: 409201541
mas 'Reeder (5.5)', id: 1529448980
mas 'Save to Raindrop.io (5.6.57)', id: 1549370672
mas 'Spark (2.11.47)', id: 1176895641
